import axios from "axios";
import { serviceOnOff, sleep } from "./serviceSetting";

export interface RRSW {
  returns: number;
  risk: number;
  sharpe: number;
  weights: {
    items: string[];
    values: number[];
    code? : string[];
  };
}

export interface FrontierData {
  frontier: RRSW[];
  specific: {
    max_returns: RRSW;
    max_sharpe: RRSW;
    min_risk: RRSW;
  };
}
export interface QueryStockInfo {
  name: string;
  code: string;
  weight: number;
}

export async function getEfficientFrontier(stockList: QueryStockInfo[], mode: string): Promise<FrontierData | undefined> {
  let result: FrontierData | undefined = undefined;

  if (serviceOnOff === false) {
    if (mode === "semi_variance") {
      result = testSpecific;
    }
    if (mode === "semi_absolute") {
      result = testAI;
    }
    await sleep(2000);
    return result;
  }

  await axios({
    method: "post",
    url: "http://192.168.175.140:5000/frontier",
    headers: {
      "Content-Type": "application/json",
    },
    data: JSON.stringify({
      mode: "original",
      codes: stockList.map((item: QueryStockInfo) => item.code),
    }),
  })
    .then(function (response) {
      result = response.data;
    })
    .catch(function (error) {
      console.log(error);
    });

  return result;
}

//["003550","005380","036570","035720","000660","015760","005930","068270"]
let testSpecific = {
  frontier: [
    {
      returns: 0.10997943597468285,
      risk: 0.121255026946792,
      sharpe: 0.7420676753811353,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0119, 0.08673, 0.10675, 0.23145, 0.28128, 0.13376, 0.08767, 0.06045],
      },
    },
    {
      returns: 0.1250167945618474,
      risk: 0.12203810565130965,
      sharpe: 0.8605246205796082,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.01998, 0.06493, 0.0882, 0.26053, 0.23736, 0.15468, 0.09887, 0.07546],
      },
    },
    {
      returns: 0.13274241607216491,
      risk: 0.12301728563799014,
      sharpe: 0.9164762129765921,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0253, 0.05557, 0.07667, 0.27453, 0.21608, 0.16756, 0.10108, 0.08321],
      },
    },
    {
      returns: 0.13865192883796756,
      risk: 0.12401949238002018,
      sharpe: 0.9567200007108129,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02942, 0.04825, 0.06806, 0.28555, 0.19967, 0.17714, 0.10282, 0.08909],
      },
    },
    {
      returns: 0.14355711789275552,
      risk: 0.12501503867229286,
      sharpe: 0.9883380368072433,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03295, 0.04214, 0.06111, 0.29446, 0.18591, 0.18488, 0.1044, 0.09415],
      },
    },
    {
      returns: 0.1479331760282836,
      risk: 0.12602582143976299,
      sharpe: 1.0151346332579334,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03618, 0.03673, 0.05485, 0.30231, 0.17366, 0.19185, 0.10581, 0.0986],
      },
    },
    {
      returns: 0.15189085935513685,
      risk: 0.12703807049198998,
      sharpe: 1.0381994849603202,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03906, 0.03186, 0.04923, 0.3094, 0.16253, 0.19815, 0.10713, 0.10264],
      },
    },
    {
      returns: 0.15551357629415,
      risk: 0.1280453029912876,
      sharpe: 1.0583252421478557,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04164, 0.02734, 0.04419, 0.3159, 0.15231, 0.20394, 0.10834, 0.10635],
      },
    },
    {
      returns: 0.15876479491429663,
      risk: 0.12901433053355074,
      sharpe: 1.0755765994399378,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04394, 0.02321, 0.0397, 0.32173, 0.14317, 0.20915, 0.10941, 0.10969],
      },
    },
    {
      returns: 0.1620115017742586,
      risk: 0.1300421142338203,
      sharpe: 1.0920423941963673,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04624, 0.01916, 0.03524, 0.3275, 0.13398, 0.21434, 0.11049, 0.11304],
      },
    },
    {
      returns: 0.16491764431081457,
      risk: 0.13101173592897533,
      sharpe: 1.1061424633696784,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04833, 0.01554, 0.03125, 0.33266, 0.12575, 0.21903, 0.11141, 0.11603],
      },
    },
    {
      returns: 0.16779547641553744,
      risk: 0.1320168636312462,
      sharpe: 1.1195196761253514,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05045, 0.01197, 0.02731, 0.33775, 0.11758, 0.22366, 0.11231, 0.11896],
      },
    },
    {
      returns: 0.17052713681199203,
      risk: 0.13301127070674948,
      sharpe: 1.1316870819455582,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05249, 0.00853, 0.02353, 0.3426, 0.1099, 0.22805, 0.11316, 0.12175],
      },
    },
    {
      returns: 0.1731894344038925,
      risk: 0.13401764422214302,
      sharpe: 1.1430542246360562,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05446, 0.00511, 0.01979, 0.34728, 0.1025, 0.23233, 0.11401, 0.12451],
      },
    },
    {
      returns: 0.17571917940218285,
      risk: 0.13500761927509605,
      sharpe: 1.1534103055686378,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0563, 0.00185, 0.01621, 0.3518, 0.09549, 0.23636, 0.11486, 0.12713],
      },
    },
    {
      returns: 0.17827416756771305,
      risk: 0.13604037350836182,
      sharpe: 1.163435261797371,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05801, 0.0, 0.0121, 0.35608, 0.08784, 0.24044, 0.11566, 0.12984],
      },
    },
    {
      returns: 0.1806765256385361,
      risk: 0.13704269108547723,
      sharpe: 1.1724560015996608,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05945, 0.0, 0.0076, 0.35986, 0.08008, 0.24432, 0.11623, 0.13244],
      },
    },
    {
      returns: 0.18294813724368536,
      risk: 0.1380177857280064,
      sharpe: 1.1806314409710177,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06082, 0.0, 0.00335, 0.36345, 0.07273, 0.248, 0.11673, 0.13491],
      },
    },
    {
      returns: 0.1852193298860128,
      risk: 0.13901877466536192,
      sharpe: 1.1884677467753502,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06217, 0.0, 0.0, 0.36681, 0.06472, 0.25174, 0.11716, 0.13739],
      },
    },
    {
      returns: 0.18744231817439674,
      risk: 0.14002864744457347,
      sharpe: 1.195771874042233,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06334, 0.0, 0.0, 0.36933, 0.05449, 0.25558, 0.11737, 0.1399],
      },
    },
    {
      returns: 0.18955252136770873,
      risk: 0.14101669200238967,
      sharpe: 1.2023578128242824,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06442, 0.0, 0.0, 0.37175, 0.04476, 0.25924, 0.11758, 0.14224],
      },
    },
    {
      returns: 0.19164072390544057,
      risk: 0.14202194476098384,
      sharpe: 1.2085507221739833,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06552, 0.0, 0.0, 0.37413, 0.03515, 0.2629, 0.11775, 0.14455],
      },
    },
    {
      returns: 0.1936348215719404,
      risk: 0.1430070496895993,
      sharpe: 1.2141696647040794,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06659, 0.0, 0.0, 0.37637, 0.02597, 0.26641, 0.11793, 0.14673],
      },
    },
    {
      returns: 0.1956211456191085,
      risk: 0.14401250618807745,
      sharpe: 1.2194853785111608,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06762, 0.0, 0.0, 0.37856, 0.01686, 0.26994, 0.11802, 0.14899],
      },
    },
    {
      returns: 0.19755847393092,
      risk: 0.14501626938064352,
      sharpe: 1.2244038182009678,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06858, 0.0, 0.0, 0.38081, 0.00798, 0.27335, 0.11808, 0.15121],
      },
    },
    {
      returns: 0.19943266307287436,
      risk: 0.14600943195600297,
      sharpe: 1.2289114522885263,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06935, 0.0, 0.0, 0.38192, 0.0, 0.27771, 0.11701, 0.154],
      },
    },
    {
      returns: 0.20107905989351432,
      risk: 0.14701158574019188,
      sharpe: 1.2317332608977407,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06869, 0.0, 0.0, 0.37053, 0.0, 0.29375, 0.10325, 0.16377],
      },
    },
    {
      returns: 0.20245947328980066,
      risk: 0.14801195787335253,
      sharpe: 1.2327346784097228,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06816, 0.0, 0.0, 0.36113, 0.0, 0.30707, 0.09161, 0.17203],
      },
    },
    {
      returns: 0.20368329270383181,
      risk: 0.1490194031372781,
      sharpe: 1.2326132626811088,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06756, 0.0, 0.0, 0.353, 0.0, 0.31891, 0.0812, 0.17932],
      },
    },
    {
      returns: 0.2047749171335192,
      risk: 0.15001198331724508,
      sharpe: 1.2317343791312827,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.067, 0.0, 0.0, 0.34576, 0.0, 0.32952, 0.07193, 0.18579],
      },
    },
    {
      returns: 0.20580444049580687,
      risk: 0.15102732946609673,
      sharpe: 1.2302703169860199,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06649, 0.0, 0.0, 0.33891, 0.0, 0.33964, 0.06315, 0.19181],
      },
    },
    {
      returns: 0.20675937865938818,
      risk: 0.1520364710538941,
      sharpe: 1.228385382565118,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0661, 0.0, 0.0, 0.33253, 0.0, 0.34906, 0.05497, 0.19734],
      },
    },
    {
      returns: 0.20764576777347937,
      risk: 0.15303035279567961,
      sharpe: 1.2261996678790708,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06567, 0.0, 0.0, 0.32662, 0.0, 0.35775, 0.04742, 0.20254],
      },
    },
    {
      returns: 0.20849445595017468,
      risk: 0.15403327666219388,
      sharpe: 1.223725548366777,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06524, 0.0, 0.0, 0.32098, 0.0, 0.36602, 0.04021, 0.20754],
      },
    },
    {
      returns: 0.2093001161577167,
      risk: 0.15503154869804506,
      sharpe: 1.2210425410018741,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06486, 0.0, 0.0, 0.31561, 0.0, 0.37386, 0.03336, 0.21231],
      },
    },
    {
      returns: 0.21006967097617874,
      risk: 0.15602641527076563,
      sharpe: 1.218189052452016,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06447, 0.0, 0.0, 0.31044, 0.0, 0.38135, 0.02686, 0.21688],
      },
    },
    {
      returns: 0.2108249600171795,
      risk: 0.1570416014046867,
      sharpe: 1.2151236252707023,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06408, 0.0, 0.0, 0.30538, 0.0, 0.38868, 0.02048, 0.22138],
      },
    },
    {
      returns: 0.21153783629386252,
      risk: 0.15803431228186982,
      sharpe: 1.2120015807215072,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0637, 0.0, 0.0, 0.30058, 0.0, 0.3956, 0.01448, 0.22563],
      },
    },
    {
      returns: 0.2122527662215253,
      risk: 0.15906301405672385,
      sharpe: 1.2086578854400785,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0633, 0.0, 0.0, 0.2958, 0.0, 0.40243, 0.00849, 0.22998],
      },
    },
    {
      returns: 0.2129047920580809,
      risk: 0.16002978145291713,
      sharpe: 1.2054305786503623,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06296, 0.0, 0.0, 0.29146, 0.0, 0.40861, 0.00299, 0.23398],
      },
    },
    {
      returns: 0.21355434171603382,
      risk: 0.1610218808615523,
      sharpe: 1.2020375161463501,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.06215, 0.0, 0.0, 0.28439, 0.0, 0.41481, 0.0, 0.23865],
      },
    },
    {
      returns: 0.21419404302403935,
      risk: 0.16204192793935435,
      sharpe: 1.1984184926306125,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0608, 0.0, 0.0, 0.27416, 0.0, 0.42095, 0.0, 0.24409],
      },
    },
    {
      returns: 0.21481142012510548,
      risk: 0.16306949908993867,
      sharpe: 1.194652716861907,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0595, 0.0, 0.0, 0.26431, 0.0, 0.4268, 0.0, 0.24939],
      },
    },
    {
      returns: 0.2153633830479975,
      risk: 0.16402373611669188,
      sharpe: 1.1910677544194552,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05838, 0.0, 0.0, 0.25545, 0.0, 0.43211, 0.0, 0.25407],
      },
    },
    {
      returns: 0.21593758194927337,
      risk: 0.16505113696884355,
      sharpe: 1.1871325793184946,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05716, 0.0, 0.0, 0.24631, 0.0, 0.43747, 0.0, 0.25906],
      },
    },
    {
      returns: 0.21650614123172895,
      risk: 0.1661021841180204,
      sharpe: 1.1830436925025962,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05596, 0.0, 0.0, 0.23728, 0.0, 0.44272, 0.0, 0.26404],
      },
    },
    {
      returns: 0.21700783137790153,
      risk: 0.1670571339753411,
      sharpe: 1.1792841568021954,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05496, 0.0, 0.0, 0.22925, 0.0, 0.44738, 0.0, 0.26842],
      },
    },
    {
      returns: 0.2175130091954052,
      risk: 0.16804439514172423,
      sharpe: 1.17536207636576,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05393, 0.0, 0.0, 0.22119, 0.0, 0.45203, 0.0, 0.27284],
      },
    },
    {
      returns: 0.2180272472045171,
      risk: 0.16907523929824556,
      sharpe: 1.1712374208455252,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05289, 0.0, 0.0, 0.213, 0.0, 0.45672, 0.0, 0.27739],
      },
    },
    {
      returns: 0.21853884264348866,
      risk: 0.1701262780922722,
      sharpe: 1.1670086765538137,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05183, 0.0, 0.0, 0.20487, 0.0, 0.46137, 0.0, 0.28193],
      },
    },
    {
      returns: 0.21898465245624454,
      risk: 0.17106258739258223,
      sharpe: 1.163227187716869,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.05088, 0.0, 0.0, 0.19783, 0.0, 0.46538, 0.0, 0.28592],
      },
    },
    {
      returns: 0.21946760463872844,
      risk: 0.17209843940982647,
      sharpe: 1.159032036099563,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04985, 0.0, 0.0, 0.19018, 0.0, 0.46978, 0.0, 0.29019],
      },
    },
    {
      returns: 0.2198980126737179,
      risk: 0.17303999112242596,
      sharpe: 1.1552128000994282,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04886, 0.0, 0.0, 0.18346, 0.0, 0.47357, 0.0, 0.29411],
      },
    },
    {
      returns: 0.2203816736939502,
      risk: 0.17411874490960286,
      sharpe: 1.1508334372498623,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04774, 0.0, 0.0, 0.1759, 0.0, 0.4779, 0.0, 0.29846],
      },
    },
    {
      returns: 0.2207989935744249,
      risk: 0.17506682322622344,
      sharpe: 1.1469848476941291,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04678, 0.0, 0.0, 0.16939, 0.0, 0.48154, 0.0, 0.30229],
      },
    },
    {
      returns: 0.22123199572689445,
      risk: 0.1760672927146591,
      sharpe: 1.1429266198408479,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04572, 0.0, 0.0, 0.16269, 0.0, 0.48533, 0.0, 0.30626],
      },
    },
    {
      returns: 0.22165187845825457,
      risk: 0.17705354835061757,
      sharpe: 1.1389315850305646,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04469, 0.0, 0.0, 0.15621, 0.0, 0.48897, 0.0, 0.31013],
      },
    },
    {
      returns: 0.2220791311930598,
      risk: 0.17807325083581754,
      sharpe: 1.1348090195723757,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04362, 0.0, 0.0, 0.14961, 0.0, 0.49273, 0.0, 0.31404],
      },
    },
    {
      returns: 0.22248712714288568,
      risk: 0.17906174420751605,
      sharpe: 1.1308229350665868,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0426, 0.0, 0.0, 0.14332, 0.0, 0.49633, 0.0, 0.31776],
      },
    },
    {
      returns: 0.22288746935129503,
      risk: 0.18004544761889205,
      sharpe: 1.1268680882215552,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04155, 0.0, 0.0, 0.13716, 0.0, 0.49988, 0.0, 0.3214],
      },
    },
    {
      returns: 0.22329813104046678,
      risk: 0.18106833679459666,
      sharpe: 1.1227701907434404,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.04059, 0.0, 0.0, 0.13075, 0.0, 0.50357, 0.0, 0.32509],
      },
    },
    {
      returns: 0.22369951100850818,
      risk: 0.18208129403659806,
      sharpe: 1.1187283794653002,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03961, 0.0, 0.0, 0.12451, 0.0, 0.50718, 0.0, 0.32869],
      },
    },
    {
      returns: 0.22407402738346285,
      risk: 0.18303801337172074,
      sharpe: 1.1149270232135953,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03872, 0.0, 0.0, 0.1187, 0.0, 0.51045, 0.0, 0.33213],
      },
    },
    {
      returns: 0.22448179394595744,
      risk: 0.1840922499261974,
      sharpe: 1.1107572101918153,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03782, 0.0, 0.0, 0.11228, 0.0, 0.51412, 0.0, 0.33578],
      },
    },
    {
      returns: 0.22486278268761697,
      risk: 0.1850887925131372,
      sharpe: 1.1068351568238595,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03688, 0.0, 0.0, 0.10637, 0.0, 0.51754, 0.0, 0.33921],
      },
    },
    {
      returns: 0.22522060476883415,
      risk: 0.18603475350910498,
      sharpe: 1.1031304683551517,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03602, 0.0, 0.0, 0.10083, 0.0, 0.52065, 0.0, 0.34251],
      },
    },
    {
      returns: 0.22561609721057813,
      risk: 0.18709161487750445,
      sharpe: 1.0990128945394069,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03505, 0.0, 0.0, 0.09468, 0.0, 0.52422, 0.0, 0.34605],
      },
    },
    {
      returns: 0.2259868762001554,
      risk: 0.1880930518552659,
      sharpe: 1.0951328300986816,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03412, 0.0, 0.0, 0.08897, 0.0, 0.52746, 0.0, 0.34946],
      },
    },
    {
      returns: 0.22635571485839132,
      risk: 0.1890993604967515,
      sharpe: 1.0912554876775284,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03325, 0.0, 0.0, 0.08324, 0.0, 0.53068, 0.0, 0.35283],
      },
    },
    {
      returns: 0.22670610523149978,
      risk: 0.1900645308402396,
      sharpe: 1.087557495960403,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03244, 0.0, 0.0, 0.07777, 0.0, 0.53376, 0.0, 0.35603],
      },
    },
    {
      returns: 0.22706007376212448,
      risk: 0.19104865682699285,
      sharpe: 1.0838080581201417,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03163, 0.0, 0.0, 0.07224, 0.0, 0.53688, 0.0, 0.35925],
      },
    },
    {
      returns: 0.22741444865413324,
      risk: 0.19204297375235593,
      sharpe: 1.0800418500163365,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03081, 0.0, 0.0, 0.06672, 0.0, 0.53998, 0.0, 0.36249],
      },
    },
    {
      returns: 0.22776606877232475,
      risk: 0.19303840686291898,
      sharpe: 1.0762939466230894,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.03, 0.0, 0.0, 0.06124, 0.0, 0.54304, 0.0, 0.36572],
      },
    },
    {
      returns: 0.22812305060029991,
      risk: 0.19405791814535178,
      sharpe: 1.0724790443459935,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02923, 0.0, 0.0, 0.05563, 0.0, 0.54615, 0.0, 0.36899],
      },
    },
    {
      returns: 0.22846986037256684,
      risk: 0.19505678477798766,
      sharpe: 1.06876497841306,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02837, 0.0, 0.0, 0.05027, 0.0, 0.54918, 0.0, 0.37217],
      },
    },
    {
      returns: 0.228805982949919,
      risk: 0.19603268424871617,
      sharpe: 1.065159025650012,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02762, 0.0, 0.0, 0.04502, 0.0, 0.55209, 0.0, 0.37527],
      },
    },
    {
      returns: 0.22916434099498284,
      risk: 0.19708163521107006,
      sharpe: 1.0613081263049826,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02672, 0.0, 0.0, 0.0395, 0.0, 0.55521, 0.0, 0.37857],
      },
    },
    {
      returns: 0.22949093961729872,
      risk: 0.1980450440822062,
      sharpe: 1.0577944052482398,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02607, 0.0, 0.0, 0.03432, 0.0, 0.55808, 0.0, 0.38153],
      },
    },
    {
      returns: 0.22982560579648595,
      risk: 0.19903961032247958,
      sharpe: 1.0541901958938282,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02529, 0.0, 0.0, 0.02911, 0.0, 0.561, 0.0, 0.3846],
      },
    },
    {
      returns: 0.23016456518243666,
      risk: 0.20005439300571123,
      sharpe: 1.0505371165552801,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02447, 0.0, 0.0, 0.02389, 0.0, 0.56387, 0.0, 0.38777],
      },
    },
    {
      returns: 0.23050194231807597,
      risk: 0.20107174769431868,
      sharpe: 1.0468996501591743,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02374, 0.0, 0.0, 0.01857, 0.0, 0.56688, 0.0, 0.39082],
      },
    },
    {
      returns: 0.2308139626444056,
      risk: 0.20201894682000268,
      sharpe: 1.0435355988279615,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.023, 0.0, 0.0, 0.0137, 0.0, 0.5697, 0.0, 0.3936],
      },
    },
    {
      returns: 0.23114663590838017,
      risk: 0.2030354844137322,
      sharpe: 1.0399494281409432,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02211, 0.0, 0.0, 0.00862, 0.0, 0.57259, 0.0, 0.39668],
      },
    },
    {
      returns: 0.23147002279154114,
      risk: 0.20403006921126635,
      sharpe: 1.036464985818198,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.02133, 0.0, 0.0, 0.0036, 0.0, 0.57546, 0.0, 0.39961],
      },
    },
    {
      returns: 0.2318076135072472,
      risk: 0.2050757947109229,
      sharpe: 1.0328260037017707,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0185, 0.0, 0.0, 0.00025, 0.0, 0.57788, 0.0, 0.40337],
      },
    },
    {
      returns: 0.2321179464840068,
      risk: 0.20604940302646968,
      sharpe: 1.0294518856565555,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.01248, 0.0, 0.0, 0.0, 0.0, 0.58053, 0.0, 0.40699],
      },
    },
    {
      returns: 0.23243352943345233,
      risk: 0.2070540170585805,
      sharpe: 1.025981202641192,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.00627, 0.0, 0.0, 0.0, 0.0, 0.58257, 0.0, 0.41116],
      },
    },
    {
      returns: 0.23273983843987878,
      risk: 0.20804255893871682,
      sharpe: 1.022578454740819,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.58529, 0.0, 0.41469],
      },
    },
    {
      returns: 0.23302297246411807,
      risk: 0.2090351568068136,
      sharpe: 1.0190772486227757,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.56921, 0.0, 0.43079],
      },
    },
    {
      returns: 0.2332765564983488,
      risk: 0.2100469359631959,
      sharpe: 1.015375708864036,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.55475, 0.0, 0.44525],
      },
    },
    {
      returns: 0.23350326001622548,
      risk: 0.21104717078003862,
      sharpe: 1.0116376316588802,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.54183, 0.0, 0.45817],
      },
    },
    {
      returns: 0.23371038835074623,
      risk: 0.2120384540869087,
      sharpe: 1.0078850521290457,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.53003, 0.0, 0.46997],
      },
    },
    {
      returns: 0.2339038773489203,
      risk: 0.21303005502987657,
      sharpe: 1.0041018734136888,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.519, 0.0, 0.481],
      },
    },
    {
      returns: 0.23408511932150539,
      risk: 0.21401510043628996,
      sharpe: 1.0003271679665253,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.50867, 0.0, 0.49133],
      },
    },
    {
      returns: 0.2342605140743534,
      risk: 0.2150192035884405,
      sharpe: 0.9964715267221467,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.49868, 0.0, 0.50132],
      },
    },
    {
      returns: 0.23442556059206407,
      risk: 0.21600902032653801,
      sharpe: 0.9926694740243707,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.48927, 0.0, 0.51073],
      },
    },
    {
      returns: 0.23458647215772618,
      risk: 0.21701519690239113,
      sharpe: 0.9888085038313823,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.4801, 0.0, 0.5199],
      },
    },
    {
      returns: 0.23474049231690028,
      risk: 0.2180156572791169,
      sharpe: 0.9849773864726443,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.47132, 0.0, 0.52868],
      },
    },
    {
      returns: 0.234888906125893,
      risk: 0.21901339803086223,
      sharpe: 0.9811678557474004,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.46286, 0.0, 0.53714],
      },
    },
    {
      returns: 0.23503284177801959,
      risk: 0.2200122013936726,
      sharpe: 0.9773678024031797,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.45466, 0.0, 0.54534],
      },
    },
    {
      returns: 0.23517362754437274,
      risk: 0.22101856439107898,
      sharpe: 0.9735545434257551,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.44664, 0.0, 0.55336],
      },
    },
    {
      returns: 0.23530995127029833,
      risk: 0.22202051693912073,
      sharpe: 0.9697750200686972,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.43887, 0.0, 0.56113],
      },
    },
    {
      returns: 0.23544167589979534,
      risk: 0.22301413380548527,
      sharpe: 0.9660449417421468,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.43136, 0.0, 0.56864],
      },
    },
    {
      returns: 0.23557264343623524,
      risk: 0.2240267341123214,
      sharpe: 0.9622630276266605,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.42389, 0.0, 0.57611],
      },
    },
    {
      returns: 0.2356986773907587,
      risk: 0.22502415442306484,
      sharpe: 0.958557884347058,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.41671, 0.0, 0.58329],
      },
    },
    {
      returns: 0.23582086903830568,
      risk: 0.22601226265533358,
      sharpe: 0.9549077846604737,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.40975, 0.0, 0.59025],
      },
    },
    {
      returns: 0.2359423691187912,
      risk: 0.2270150671547369,
      sharpe: 0.95122483201347,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.40282, 0.0, 0.59718],
      },
    },
    {
      returns: 0.23606055253514335,
      risk: 0.228009603964142,
      sharpe: 0.947594087173285,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.39609, 0.0, 0.60391],
      },
    },
    {
      returns: 0.23617824236993848,
      risk: 0.22901847924503188,
      sharpe: 0.9439336209138157,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.38938, 0.0, 0.61062],
      },
    },
    {
      returns: 0.236291798906636,
      risk: 0.23000910086978044,
      sharpe: 0.9403619165012499,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.38291, 0.0, 0.61709],
      },
    },
    {
      returns: 0.23640445733313548,
      risk: 0.23100833356115194,
      sharpe: 0.9367820372413078,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.37649, 0.0, 0.62351],
      },
    },
    {
      returns: 0.23651545120886405,
      risk: 0.23200847794357599,
      sharpe: 0.9332221526039243,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.37016, 0.0, 0.62984],
      },
    },
    {
      returns: 0.23662621259839126,
      risk: 0.2330217811916204,
      sharpe: 0.9296393302403495,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.36385, 0.0, 0.63615],
      },
    },
    {
      returns: 0.23673357642508439,
      risk: 0.23401828335092015,
      sharpe: 0.9261395021007114,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.35773, 0.0, 0.64227],
      },
    },
    {
      returns: 0.2368395245664889,
      risk: 0.23501525316970295,
      sharpe: 0.922661493847425,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.35169, 0.0, 0.64831],
      },
    },
    {
      returns: 0.23694376551122323,
      risk: 0.23600912932827936,
      sharpe: 0.9192176850475264,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.34575, 0.0, 0.65425],
      },
    },
    {
      returns: 0.23704771758496154,
      risk: 0.2370128959452887,
      sharpe: 0.9157633246887298,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.33983, 0.0, 0.66017],
      },
    },
    {
      returns: 0.23715006576337153,
      risk: 0.23801340419388486,
      sharpe: 0.9123438509643006,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.33399, 0.0, 0.66601],
      },
    },
    {
      returns: 0.23725108226648323,
      risk: 0.23901267246889474,
      sharpe: 0.9089521489483217,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.32824, 0.0, 0.67176],
      },
    },
    {
      returns: 0.23735112211214973,
      risk: 0.24001368149380406,
      sharpe: 0.9055780518818493,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.32253, 0.0, 0.67747],
      },
    },
    {
      returns: 0.23745029001760712,
      risk: 0.2410170240975784,
      sharpe: 0.902219628807507,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.31688, 0.0, 0.68312],
      },
    },
    {
      returns: 0.23754785277449436,
      risk: 0.24201472552113495,
      sharpe: 0.8989033717103139,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.31132, 0.0, 0.68868],
      },
    },
    {
      returns: 0.2376445294749676,
      risk: 0.24301366424050624,
      sharpe: 0.8956061386719749,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.30581, 0.0, 0.69419],
      },
    },
    {
      returns: 0.2377396384419732,
      risk: 0.24400630202004817,
      sharpe: 0.8923525197479661,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.30039, 0.0, 0.69961],
      },
    },
    {
      returns: 0.23783536122812127,
      risk: 0.24501526655184863,
      sharpe: 0.8890685233363786,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.29494, 0.0, 0.70506],
      },
    },
    {
      returns: 0.23792948103037243,
      risk: 0.24601693881231684,
      sharpe: 0.8858312036661347,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.28957, 0.0, 0.71043],
      },
    },
    {
      returns: 0.23802165773957093,
      risk: 0.24700710340901894,
      sharpe: 0.8826533922732942,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.28432, 0.0, 0.71568],
      },
    },
    {
      returns: 0.23811392160285072,
      risk: 0.24800728656511378,
      sharpe: 0.8794657795088024,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.27906, 0.0, 0.72094],
      },
    },
    {
      returns: 0.23820527151749976,
      risk: 0.24900640693849946,
      sharpe: 0.8763038437456468,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.27385, 0.0, 0.72615],
      },
    },
    {
      returns: 0.23829601672116085,
      risk: 0.2500075600252332,
      sharpe: 0.8731576625087989,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.26868, 0.0, 0.73132],
      },
    },
    {
      returns: 0.23838589302722202,
      risk: 0.2510076433954139,
      sharpe: 0.8700368246683124,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.26356, 0.0, 0.73644],
      },
    },
    {
      returns: 0.23847532663961687,
      risk: 0.25201122594958797,
      sharpe: 0.8669269625445989,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.25846, 0.0, 0.74154],
      },
    },
    {
      returns: 0.23856341855530394,
      risk: 0.25300788682869535,
      sharpe: 0.8638601005481192,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.25344, 0.0, 0.74656],
      },
    },
    {
      returns: 0.23865165474234085,
      risk: 0.2540142608283152,
      sharpe: 0.8607849576214328,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.24841, 0.0, 0.75159],
      },
    },
    {
      returns: 0.23873814341723343,
      risk: 0.25500852716494576,
      sharpe: 0.8577679572093221,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.24348, 0.0, 0.75652],
      },
    },
    {
      returns: 0.23882439873272834,
      risk: 0.256007797532041,
      sharpe: 0.854756772419563,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.23857, 0.0, 0.76143],
      },
    },
    {
      returns: 0.238910022241653,
      risk: 0.25700725225623433,
      sharpe: 0.8517659339176987,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.23369, 0.0, 0.76631],
      },
    },
    {
      returns: 0.23899501943250032,
      risk: 0.2580066973501857,
      sharpe: 0.8487958711213769,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.22884, 0.0, 0.77116],
      },
    },
    {
      returns: 0.23907933281526036,
      risk: 0.25900519217325446,
      sharpe: 0.8458491931262645,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.22404, 0.0, 0.77596],
      },
    },
    {
      returns: 0.23916299704180347,
      risk: 0.260002993075041,
      sharpe: 0.842924900401241,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.21927, 0.0, 0.78073],
      },
    },
    {
      returns: 0.2392462850128775,
      risk: 0.261003211041221,
      sharpe: 0.8400137459544562,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.21452, 0.0, 0.78548],
      },
    },
    {
      returns: 0.23932911830696627,
      risk: 0.2620047652769832,
      sharpe: 0.8371188137555378,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.2098, 0.0, 0.7902],
      },
    },
    {
      returns: 0.23941155556522659,
      risk: 0.2630081797625032,
      sharpe: 0.8342385235446121,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.2051, 0.0, 0.7949],
      },
    },
    {
      returns: 0.23949304715048772,
      risk: 0.26400650106847334,
      sharpe: 0.8313925841301897,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.20046, 0.0, 0.79954],
      },
    },
    {
      returns: 0.23957450218641532,
      risk: 0.2650106534300488,
      sharpe: 0.82854971807529,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.19582, 0.0, 0.80418],
      },
    },
    {
      returns: 0.23965511371104287,
      risk: 0.2660104874166723,
      sharpe: 0.8257385482963326,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.19122, 0.0, 0.80878],
      },
    },
    {
      returns: 0.23973483417557498,
      risk: 0.2670051552726399,
      sharpe: 0.8229610171803723,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.18668, 0.0, 0.81332],
      },
    },
    {
      returns: 0.23981516433981453,
      risk: 0.26801330604244833,
      sharpe: 0.8201651163729905,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.1821, 0.0, 0.8179],
      },
    },
    {
      returns: 0.23989370744117164,
      risk: 0.2690046814204007,
      sharpe: 0.8174345006937691,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.17763, 0.0, 0.82237],
      },
    },
    {
      returns: 0.23997289200836325,
      risk: 0.2700098606609985,
      sharpe: 0.8146846617744178,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.17311, 0.0, 0.82689],
      },
    },
    {
      returns: 0.24005117257838854,
      risk: 0.27100912107460584,
      sharpe: 0.8119696182395679,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.16865, 0.0, 0.83135],
      },
    },
    {
      returns: 0.24012893196328333,
      risk: 0.27200715437741674,
      sharpe: 0.809276257704049,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.16422, 0.0, 0.83578],
      },
    },
    {
      returns: 0.24020629869740576,
      risk: 0.2730055081311017,
      sharpe: 0.8066002045338189,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.15981, 0.0, 0.84019],
      },
    },
    {
      returns: 0.24028373390891872,
      risk: 0.27401010453831226,
      sharpe: 0.803925586175303,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.1554, 0.0, 0.8446],
      },
    },
    {
      returns: 0.24036029790054636,
      risk: 0.2750086104670073,
      sharpe: 0.8012850853154757,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.15103, 0.0, 0.84897],
      },
    },
    {
      returns: 0.24043646280495917,
      risk: 0.2760069977628661,
      sharpe: 0.7986625867882856,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.14669, 0.0, 0.85331],
      },
    },
    {
      returns: 0.24051216824898394,
      risk: 0.27700437590098576,
      sharpe: 0.7960602338202962,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.14238, 0.0, 0.85762],
      },
    },
    {
      returns: 0.24058830845449652,
      risk: 0.2780125330747926,
      sharpe: 0.7934473529477627,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.13804, 0.0, 0.86196],
      },
    },
    {
      returns: 0.24066259395925188,
      risk: 0.2790009560464473,
      sharpe: 0.7909026445146539,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.1338, 0.0, 0.8662],
      },
    },
    {
      returns: 0.24073806472254303,
      risk: 0.28001003813266534,
      sharpe: 0.7883219694358244,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.1295, 0.0, 0.8705],
      },
    },
    {
      returns: 0.24081268104152806,
      risk: 0.28101245082306603,
      sharpe: 0.7857754359096296,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.12525, 0.0, 0.87475],
      },
    },
    {
      returns: 0.24088598262682187,
      risk: 0.28200178752686683,
      sharpe: 0.7832786613303919,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.12107, 0.0, 0.87893],
      },
    },
    {
      returns: 0.24096040810786679,
      risk: 0.28301099171916927,
      sharpe: 0.780748502966715,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.11683, 0.0, 0.88317],
      },
    },
    {
      returns: 0.24103341089126204,
      risk: 0.2840054447577987,
      sharpe: 0.7782717372892638,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.11267, 0.0, 0.88733],
      },
    },
    {
      returns: 0.24110676127948757,
      risk: 0.28500937656445213,
      sharpe: 0.7757876738819729,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.10849, 0.0, 0.89151],
      },
    },
    {
      returns: 0.24117926964656958,
      risk: 0.28600649868192085,
      sharpe: 0.7733365174074307,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.10436, 0.0, 0.89564],
      },
    },
    {
      returns: 0.24125153193362334,
      risk: 0.2870048716094831,
      sharpe: 0.7708981756751226,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.10024, 0.0, 0.89976],
      },
    },
    {
      returns: 0.24132389045753952,
      risk: 0.2880091604427819,
      sharpe: 0.7684612882356894,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.09612, 0.0, 0.90388],
      },
    },
    {
      returns: 0.2413951972568462,
      risk: 0.2890032717735159,
      sharpe: 0.7660646742793543,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.09205, 0.0, 0.90795],
      },
    },
    {
      returns: 0.24146694710787672,
      risk: 0.290007968547225,
      sharpe: 0.7636581443513438,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.08796, 0.0, 0.91204],
      },
    },
    {
      returns: 0.24153784041433773,
      risk: 0.291004951970544,
      sharpe: 0.7612854658114622,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.08392, 0.0, 0.91608],
      },
    },
    {
      returns: 0.24160905685058995,
      risk: 0.29201076284415073,
      sharpe: 0.7589071535999004,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.07986, 0.0, 0.92014],
      },
    },
    {
      returns: 0.2416791501224338,
      risk: 0.29300484515902275,
      sharpe: 0.7565716191557232,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.07587, 0.0, 0.92413],
      },
    },
    {
      returns: 0.241749792639456,
      risk: 0.2940108652186688,
      sharpe: 0.7542231219058212,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.07184, 0.0, 0.92816],
      },
    },
    {
      returns: 0.24181971748604683,
      risk: 0.2950107057311077,
      sharpe: 0.7519039586591411,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.06786, 0.0, 0.93214],
      },
    },
    {
      returns: 0.24188886814639562,
      risk: 0.29600342815636055,
      sharpe: 0.7496158727904505,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.06392, 0.0, 0.93608],
      },
    },
    {
      returns: 0.2419582447299875,
      risk: 0.2970033270838271,
      sharpe: 0.7473257855705481,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.05996, 0.0, 0.94004],
      },
    },
    {
      returns: 0.24202780295703624,
      risk: 0.29800977318492644,
      sharpe: 0.7450353073463115,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.056, 0.0, 0.944],
      },
    },
    {
      returns: 0.2420965101291908,
      risk: 0.29900777012883906,
      sharpe: 0.7427783901183971,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.05208, 0.0, 0.94792],
      },
    },
    {
      returns: 0.24216480361649448,
      risk: 0.3000035790316098,
      sharpe: 0.740540510661995,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.04819, 0.0, 0.95181],
      },
    },
    {
      returns: 0.24223312918289042,
      risk: 0.3010036842070161,
      sharpe: 0.7383070070001169,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.0443, 0.0, 0.9557],
      },
    },
    {
      returns: 0.24230140375633716,
      risk: 0.30200683237336684,
      sharpe: 0.7360807105234926,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.0404, 0.0, 0.9596],
      },
    },
    {
      returns: 0.2423690386818998,
      risk: 0.30300425614490856,
      sharpe: 0.7338809081795675,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.03655, 0.0, 0.96345],
      },
    },
    {
      returns: 0.24243711416254346,
      risk: 0.30401185365924277,
      sharpe: 0.731672503835545,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.03267, 0.0, 0.96733],
      },
    },
    {
      returns: 0.2425043433874638,
      risk: 0.30501046673493565,
      sharpe: 0.7294974030541305,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.02884, 0.0, 0.97116],
      },
    },
    {
      returns: 0.24257119635923868,
      risk: 0.3060069577516929,
      sharpe: 0.7273403127645302,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.02503, 0.0, 0.97497],
      },
    },
    {
      returns: 0.24263847016609788,
      risk: 0.30701321124422193,
      sharpe: 0.725175536465739,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.02119, 0.0, 0.97881],
      },
    },
    {
      returns: 0.24270465118540263,
      risk: 0.30800644903567226,
      sharpe: 0.7230519097332594,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.01742, 0.0, 0.98258],
      },
    },
    {
      returns: 0.24277106494896322,
      risk: 0.30900651805360185,
      sharpe: 0.7209267505170238,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.01364, 0.0, 0.98636],
      },
    },
    {
      returns: 0.2428373360152123,
      risk: 0.3100077870659197,
      sharpe: 0.7188120599300573,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.00986, 0.0, 0.99014],
      },
    },
    {
      returns: 0.2429033512772464,
      risk: 0.31100854655194526,
      sharpe: 0.7167113371915542,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.0061, 0.0, 0.9939],
      },
    },
    {
      returns: 0.2429688114295486,
      risk: 0.3120041732916853,
      sharpe: 0.7146340674780025,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.00237, 0.0, 0.99763],
      },
    },
    {
      returns: 0.24301034042029296,
      risk: 0.31263745951111577,
      sharpe: 0.7133193212643921,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0],
      },
    },
  ],
  specific: {
    max_returns: {
      returns: 0.24301034042029296,
      risk: 0.31263745951111577,
      sharpe: 0.7133193212643921,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0],
      },
    },
    max_sharpe: {
      returns: 0.23316163559147515,
      risk: 0.20957055282283574,
      sharpe: 1.0171354358724014,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.56139, 0.0, 0.43862],
      },
    },
    min_risk: {
      returns: 0.10997943597468285,
      risk: 0.121255026946792,
      sharpe: 0.7420676753811353,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0119, 0.08673, 0.10675, 0.23145, 0.28128, 0.13376, 0.08767, 0.06045],
      },
    },
  },
  worst: [
    {
      returns: 0.08637503596759499,
      risk: 0.12301599717645607,
      sharpe: 0.5395642639256552,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.11181, 0.14196, 0.18647, 0.34718, 0.09177, 0.08542, 0.03538],
      },
    },
    {
      returns: 0.07598965520442905,
      risk: 0.12501184635597876,
      sharpe: 0.4478747961612784,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.12472, 0.15496, 0.16221, 0.37806, 0.07489, 0.08037, 0.02478],
      },
    },
    {
      returns: 0.07184371950627957,
      risk: 0.12601287404236386,
      sharpe: 0.41141605490920236,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.12984, 0.16024, 0.15243, 0.39039, 0.06824, 0.07829, 0.02058],
      },
    },
    {
      returns: 0.06809677280736935,
      risk: 0.12701465200086517,
      sharpe: 0.3786710592022228,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.13443, 0.16511, 0.14345, 0.4015, 0.06239, 0.07639, 0.01673],
      },
    },
    {
      returns: 0.06466045254929638,
      risk: 0.12801318276580198,
      sharpe: 0.34887385489822514,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.1386, 0.1696, 0.13517, 0.41171, 0.05704, 0.07466, 0.01322],
      },
    },
    {
      returns: 0.06145001294489734,
      risk: 0.1290140141595582,
      sharpe: 0.321283026614721,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.1425, 0.17385, 0.12743, 0.4212, 0.05197, 0.07305, 0.01],
      },
    },
    {
      returns: 0.05842961764404966,
      risk: 0.1300143461638302,
      sharpe: 0.2955798246727692,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.14616, 0.17784, 0.12018, 0.43013, 0.04711, 0.07159, 0.007],
      },
    },
    {
      returns: 0.05554695491012726,
      risk: 0.13102163795605928,
      sharpe: 0.27130598780980464,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.14966, 0.1816, 0.11327, 0.43866, 0.04244, 0.07024, 0.00413],
      },
    },
    {
      returns: 0.05283808348987128,
      risk: 0.13201428743087848,
      sharpe: 0.24874643592698267,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.15297, 0.18515, 0.1068, 0.44665, 0.03805, 0.06896, 0.00141],
      },
    },
    {
      returns: 0.05019692152230182,
      risk: 0.1330252034788502,
      sharpe: 0.22700150597478963,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.15622, 0.18875, 0.0997, 0.45462, 0.03315, 0.06755, 0.0],
      },
    },
    {
      returns: 0.04770084876938328,
      risk: 0.13402335100625629,
      sharpe: 0.20668673452352487,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.15935, 0.19236, 0.09208, 0.46228, 0.02786, 0.06608, 0.0],
      },
    },
    {
      returns: 0.045321151745478294,
      risk: 0.13501350344461988,
      sharpe: 0.18754532768542354,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.16231, 0.19581, 0.08477, 0.4696, 0.02287, 0.06465, 0.0],
      },
    },
    {
      returns: 0.04294195692553336,
      risk: 0.1360405008301005,
      sharpe: 0.1686406385270907,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.16526, 0.19921, 0.07738, 0.47698, 0.01798, 0.06318, 0.0],
      },
    },
    {
      returns: 0.040735870843741195,
      risk: 0.1370253713497997,
      sharpe: 0.15132869657259648,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.16796, 0.20237, 0.07053, 0.48387, 0.01348, 0.06178, 0.0],
      },
    },
    {
      returns: 0.038549107239577475,
      risk: 0.13803204464836377,
      sharpe: 0.13438261591235043,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.1706, 0.2055, 0.06379, 0.49071, 0.00898, 0.06042, 0.0],
      },
    },
    {
      returns: 0.036466965901562655,
      risk: 0.13901836171146945,
      sharpe: 0.11845173327347648,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.17305, 0.20848, 0.05731, 0.49729, 0.00478, 0.05908, 0.0],
      },
    },
    {
      returns: 0.034426764373472946,
      risk: 0.14001101999522167,
      sharpe: 0.10304020622066253,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.17542, 0.21145, 0.05085, 0.50376, 0.0008, 0.05772, 0.0],
      },
    },
    {
      returns: 0.032353432413394285,
      risk: 0.14104972215403705,
      sharpe: 0.08758211093747065,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.17775, 0.2147, 0.04152, 0.51121, 0.0, 0.05481, 0.0],
      },
    },
    {
      returns: 0.030469742057854986,
      risk: 0.14202545834646602,
      sharpe: 0.07371736151918921,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.17982, 0.21775, 0.03239, 0.51815, 0.0, 0.05189, 0.0],
      },
    },
    {
      returns: 0.028597985395053923,
      risk: 0.14302497698424374,
      sharpe: 0.06011527200595959,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.1819, 0.22081, 0.0233, 0.52502, 0.0, 0.04897, 0.0],
      },
    },
    {
      returns: 0.026792631928232738,
      risk: 0.1440168881753522,
      sharpe: 0.047165523531949666,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18391, 0.22379, 0.01452, 0.53161, 0.0, 0.04616, 0.0],
      },
    },
    {
      returns: 0.025013077657854696,
      risk: 0.14502107189687122,
      sharpe: 0.03456792583507894,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18587, 0.22671, 0.00598, 0.53816, 0.0, 0.04329, 0.0],
      },
    },
    {
      returns: 0.02330517382999317,
      risk: 0.14601086231275773,
      sharpe: 0.022636492776225314,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18663, 0.22897, 0.0, 0.54575, 0.0, 0.03865, 0.0],
      },
    },
    {
      returns: 0.021664234496520385,
      risk: 0.1470142689917094,
      sharpe: 0.011320224274381391,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18462, 0.22973, 0.0, 0.55637, 0.0, 0.02928, 0.0],
      },
    },
    {
      returns: 0.02010751254232577,
      risk: 0.14802324521064827,
      sharpe: 0.000726322019036738,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18268, 0.23041, 0.0, 0.5665, 0.0, 0.02041, 0.0],
      },
    },
    {
      returns: 0.01864387940454667,
      risk: 0.1490217952370673,
      sharpe: -0.009100149366043964,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.18098, 0.23101, 0.0, 0.57598, 0.0, 0.01203, 0.0],
      },
    },
    {
      returns: 0.017237131245614244,
      risk: 0.15002606904621668,
      sharpe: -0.01841592445866614,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.17917, 0.2315, 0.0, 0.58526, 0.0, 0.00407, 0.0],
      },
    },
    {
      returns: 0.015919717141210814,
      risk: 0.15101935242867875,
      sharpe: -0.027018278076090703,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.16985, 0.23029, 0.0, 0.59985, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.014757443224777279,
      risk: 0.1520162949118624,
      sharpe: -0.034486807998197214,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.15355, 0.22746, 0.0, 0.619, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.013705134582616687,
      risk: 0.15302773918352972,
      sharpe: -0.04113545329081635,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.13882, 0.22482, 0.0, 0.63635, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.012752102116916835,
      risk: 0.1540325101808226,
      sharpe: -0.047054338558624266,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.12559, 0.2223, 0.0, 0.65211, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.011887712812618965,
      risk: 0.15501504783563128,
      sharpe: -0.05233225613027467,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.11371, 0.21984, 0.0, 0.66646, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.011052687743653623,
      risk: 0.15602771480650224,
      sharpe: -0.0573443780000392,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.10234, 0.21729, 0.0, 0.68037, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.010264424473204232,
      risk: 0.15704056746862594,
      sharpe: -0.06199401647437865,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.09168, 0.21479, 0.0, 0.69353, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.009536902289085042,
      risk: 0.15802332219941706,
      sharpe: -0.06621236387949801,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.08191, 0.21238, 0.0, 0.70571, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.008808468684618516,
      risk: 0.15905262553323646,
      sharpe: -0.07036370055420961,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0721, 0.21001, 0.0, 0.71789, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.008151706144863385,
      risk: 0.16001852806584538,
      sharpe: -0.07404326235435192,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.06324, 0.20789, 0.0, 0.72886, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.00746423804999918,
      risk: 0.1610677086414689,
      sharpe: -0.07782914437495965,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.05397, 0.20567, 0.0, 0.74036, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.006826383825081508,
      risk: 0.16207569494750138,
      sharpe: -0.08128063976024051,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.04538, 0.2036, 0.0, 0.75102, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.006244388762816332,
      risk: 0.16302422041285458,
      sharpe: -0.08437771517844368,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.03753, 0.20172, 0.0, 0.76075, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.005628831102679057,
      risk: 0.1640573140243196,
      sharpe: -0.08759846510220558,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.02921, 0.19975, 0.0, 0.77103, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.005025360323518675,
      risk: 0.1650997041411568,
      sharpe: -0.09070058456118324,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.02115, 0.19769, 0.0, 0.78115, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.004470136384216402,
      risk: 0.16608419275304726,
      sharpe: -0.09350597042594629,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.01361, 0.19599, 0.0, 0.79041, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.0038554602068336784,
      risk: 0.1672022723985115,
      sharpe: -0.09655694005573844,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.00545, 0.19381, 0.0, 0.80074, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.003404153041892533,
      risk: 0.16804178815025897,
      sharpe: -0.09876023780030152,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.19142, 0.0, 0.80857, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.00286312257958334,
      risk: 0.1690913658022183,
      sharpe: -0.10134685079344154,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.17916, 0.0, 0.82083, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.002401642231684677,
      risk: 0.1700315375306856,
      sharpe: -0.10350055068542416,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.16871, 0.0, 0.83129, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.0019216904647093608,
      risk: 0.17105291260724992,
      sharpe: -0.10568840518255172,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.15782, 0.0, 0.84218, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.0014116846502650366,
      risk: 0.17218665299912922,
      sharpe: -0.10795444958111224,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.14626, 0.0, 0.85374, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.0009827795335038993,
      risk: 0.17317827986088302,
      sharpe: -0.10981296546987848,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.13653, 0.0, 0.86347, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.0005792820970585277,
      risk: 0.17414264014173214,
      sharpe: -0.11152189887057665,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.12738, 0.0, 0.87261, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: 0.000209555787841861,
      risk: 0.175052449539099,
      sharpe: -0.11305436892922671,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.119, 0.0, 0.881, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.00019564017659300963,
      risk: 0.17607793765419014,
      sharpe: -0.11469716448097217,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.10982, 0.0, 0.89018, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0005833899052627618,
      risk: 0.17708629935937964,
      sharpe: -0.11623366674736789,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.10102, 0.0, 0.89897, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0009450988953783628,
      risk: 0.17805033002183188,
      sharpe: -0.1176358330411977,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.09282, 0.0, 0.90718, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.001328176446225098,
      risk: 0.17909577943010943,
      sharpe: -0.11908810198706125,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.08414, 0.0, 0.91586, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0016824860556384736,
      risk: 0.18008452508718148,
      sharpe: -0.12040171716665646,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0761, 0.0, 0.9239, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.002017655304343683,
      risk: 0.1810388009975371,
      sharpe: -0.12161843308188511,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.06851, 0.0, 0.93149, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0023633875559476657,
      risk: 0.1820420816027706,
      sharpe: -0.12284735133245864,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.06067, 0.0, 0.93933, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0027428106295254353,
      risk: 0.1831649565157062,
      sharpe: -0.12416573050956536,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.05206, 0.0, 0.94794, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.0030329178084097814,
      risk: 0.18403838925790592,
      sharpe: -0.12515278959615397,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.04549, 0.0, 0.95451, 0.0, 0.0, 0.0],
      },
    },
    {
      returns: -0.003377576106774725,
      risk: 0.18509381087132362,
      sharpe: -0.1263012306933737,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.03767, 0.0, 0.96233, 0.0, 0.0, 0.0],
      },
    },
  ],
};

let testAI = {
  frontier: [
    {
      returns: 0.14820800669970205,
      risk: 0.0148019031143842,
      sharpe: 8.661589371917454,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.09686, 0.11502, 0.08973, 0.08755, 0.10606, 0.19005, 0.17356, 0.14116],
      },
    },
    {
      returns: 0.12982258846815847,
      risk: 0.014036175993856538,
      sharpe: 7.824252739223736,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13032, 0.14313, 0.13037, 0.13181, 0.13335, 0.09284, 0.11396, 0.12422],
      },
    },
    {
      returns: 0.1297725294960736,
      risk: 0.014035174086377606,
      sharpe: 7.821244597358979,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.1304, 0.14327, 0.1305, 0.13196, 0.13339, 0.09255, 0.11374, 0.12419],
      },
    },
    {
      returns: 0.1297225643350483,
      risk: 0.0140341840465081,
      sharpe: 7.818236099187313,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13048, 0.1434, 0.13063, 0.13212, 0.13341, 0.09226, 0.11352, 0.12417],
      },
    },
    {
      returns: 0.12967228160111666,
      risk: 0.014033197676560905,
      sharpe: 7.8152025025841345,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13057, 0.14354, 0.13076, 0.13228, 0.13344, 0.09198, 0.11328, 0.12414],
      },
    },
    {
      returns: 0.12962149648298477,
      risk: 0.014032210702197073,
      sharpe: 7.812133013782421,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13066, 0.14368, 0.1309, 0.13245, 0.13347, 0.09169, 0.11304, 0.12411],
      },
    },
    {
      returns: 0.12957024905935813,
      risk: 0.014031222194896506,
      sharpe: 7.809030997970473,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13076, 0.14383, 0.13104, 0.13262, 0.13349, 0.0914, 0.11278, 0.12409],
      },
    },
    {
      returns: 0.12951879363840071,
      risk: 0.014030233882190525,
      sharpe: 7.805913611847906,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.13085, 0.14397, 0.13119, 0.1328, 0.13351, 0.09111, 0.11252, 0.12405],
      },
    },
    {
      returns: 0.13594564134011558,
      risk: 0.014323282293001213,
      sharpe: 8.094907226451168,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.11992, 0.1442, 0.11971, 0.11662, 0.11992, 0.10996, 0.11965, 0.15003],
      },
    },
  ],
  specific: {
    max_returns: {
      returns: 0.13594564134011558,
      risk: 0.014323282293001213,
      sharpe: 8.094907226451168,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.11992, 0.1442, 0.11971, 0.11662, 0.11992, 0.10996, 0.11965, 0.15003],
      },
    },
    max_sharpe: {
      returns: 0.18743834010727753,
      risk: 0.02121501690909826,
      sharpe: 7.892444339060131,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.0, 0.0, 0.0, 0.0, 0.0, 0.41962, 0.58038, 0.0],
      },
    },
    min_risk: {
      returns: 0.14820800669970205,
      risk: 0.0148019031143842,
      sharpe: 8.661589371917454,
      weights: {
        items: ["SK하이닉스", "LG", "현대차", "삼성전자", "한국전력", "카카오", "엔씨소프트", "셀트리온"],
        values: [0.09686, 0.11502, 0.08973, 0.08755, 0.10606, 0.19005, 0.17356, 0.14116],
      },
    },
  },
  worst: [[], [], []],
};
